export const questionsByPage: { [key: string]: { text: string; type: "C" | "T" }[] } = {
    "1": [
        { text: "คณะกรรมการได้กำกับดูแลและขับเคลื่อนความยั่งยืนขององค์กรอย่างไร", type: "T" },
        { text: "มีการพิจารณาระบุประเด็นสำคัญด้านการกำกับดูแลกิจการ สังคม หรือสิ่งแวดล้อม", type: "C" },
        { text: "มีการติดตามและทบทวนปรับปรุงประเด็นสำคัญด้านการกำกับดูแลกิจการ สังคม หรือสิ่งแวดล้อม อย่างน้อยปีละครั้ง", type: "C" }
    ],
    "2": [
        { text: "มีบุคคล หรือหน่วยงาน ที่รับผิดชอบเรื่องความยั่งยืนขององค์กร", type: "C" },
        { text: "กำหนดเป้าหมายและกลยุทธ์เพื่อความยั่งยืนโดยวิเคราะห์สภาพแวดล้อม", type: "C" },
        { text: "กำหนดให้ฝ่ายจัดการเสนอแผนงานและงบประมาณที่สอดคล้องกับกลยุทธ์องค์กร", type: "C" },
        { text: "ติดตามและประเมินผลการดำเนินงานด้านความยั่งยืน", type: "C" },
        { text: "พิจารณาผลกระทบของการดำเนินงานต่อสิ่งแวดล้อมและสังคม", type: "C" }
    ],
    "3": [
        { text: "องค์กรมีนโยบายด้านความยั่งยืนหรือไม่?", type: "C" },
        { text: "นโยบายความยั่งยืนถูกนำไปปฏิบัติอย่างไร?", type: "T" },
        { text: "มีการจัดทำรายงานความยั่งยืนหรือไม่?", type: "C" },
        { text: "รายงานความยั่งยืนมีการเปิดเผยข้อมูลอะไรบ้าง?", type: "T" }
    ],
};
