// C – Checkbox
// CT – Checkbox + Textfield (if checked)
// CU – Checkbox + File uploader (if checked)
// Sq - Sub Question

export const questionsByPage: {
  [key: string]: {name: string;questions: { id: string; text: string; type: "C" | "CT" | "CU" | "Sq" }[];};
} = {
  "1": {
    name: "G1 คุณสมบัติของคณะกรรมการ",
    questions: [
      {
        id: "G1-1",
        text: "คณะกรรมการประกอบด้วยกรรมการที่มีคุณสมบัติอย่างไร",
        type: "Sq",
      },
      {
        id: "G1-2",
        text: "มีการจัดทำตารางทักษะและประสบการณ์ที่จำเป็นสำหรับธุรกิจ (Skill Matrix) ของคณะกรรมการ",
        type: "CU",
      },
      {
        id: "G1-3",
        text: "ใช้ Skill Matrix ในการสรรหากรรมการตามทักษะที่ยังขาดอยู่",
        type: "C",
      },
      {
        id: "G1-4",
        text: "มีกรรมการอย่างน้อย 1 คนที่มีความรู้ด้านการกำกับดูแลกิจการ สังคม หรือสิ่งแวดล้อม",
        type: "CT",
      },
    ],
  },
  "2": {
    name: "G2 การขับเคลื่อนความยั่งยืนขององค์กร",
    questions: [
      {
        id: "G2-1",
        text: "คณะกรรมการได้กำกับดูแลและขับเคลื่อนความยั่งยืนขององค์กรอย่างไร",
        type: "Sq",
      },
      {
        id: "G2-2",
        text: "มีการพิจารณาระบุประเด็นสำคัญด้านการกำกับดูแลกิจการ สังคม หรือสิ่งแวดล้อม",
        type: "C",
      },
      {
        id: "G2-3",
        text: "มีการติดตามและทบทวนปรับปรุงประเด็นสำคัญด้านการกำกับดูแลกิจการ สังคม หรือสิ่งแวดล้อม อย่างน้อยปีละครั้ง",
        type: "C",
      },
      {
        id: "G2-4",
        text: "มีบุคคล หรือหน่วยงาน ที่รับผิดชอบเรื่องความยั่งยืนขององค์กร",
        type: "CT",
      },
      {
        id: "G2-5",
        text: "กำหนดเป้าหมายและกลยุทธ์เพื่อความยั่งยืนโดยวิเคราะห์สภาพแวดล้อม ปัจจัยและความเสี่ยงต่างๆ ให้ทันต่อการเปลี่ยนแปลงของธุรกิจ โดยมีข้อมูลจากผู้มีส่วนเกี่ยวข้องทั้งจากภายในและภายนอกองค์กรประกอบ",
        type: "C",
      },
      {
        id: "G2-6",
        text: "กำหนดให้ฝ่ายจัดการเสนอแผนงานและงบประมาณที่สอดคล้องกับกลยุทธ์องค์กร",
        type: "CU",
      },
    ],
  },
  "3": {
    name: "G3 การปฏิบัติหน้าที่ของคณะกรรมการ",
    questions: [
      {
        id: "G3-1",
        text: "คณะกรรมการมีการปฏิบัติหน้าที่อย่างมีประสิทธิภาพหรือไม่",
        type: "Sq",
      },
      {
        id: "G3-2",
        text: "เข้าประชุมคณะกรรมการครบทุกครั้งและได้ให้ความเห็นที่เป็นประโยชน์ต่อการบริหารกิจการเพื่อสร้างผลประกอบการที่ดี",
        type: "CU",
      },
      {
        id: "G3-3",
        text: "มีการประเมินผลการปฏิบัติงานของคณะกรรมการเป็นประจำทุกปี",
        type: "CU",
      },
      {
        id: "G3-4",
        text: "มีการพัฒนาศักยภาพของคณะกรรมการ อย่างน้อยมีการอบรมเรื่องสังคม สิ่งแวดล้อม และการกำกับดูแลที่สอดคล้องกับสภาพแวดล้อมที่เปลี่ยนแปลงในปัจจุบันและเกี่ยวข้องกับธุรกิจที่ตนเป็นกรรมการ",
        type: "C",
      },
    ],
  },
  "4": {
    name: "G4 นโยบายและแนวปฏิบัติในการขับเคลื่อนความยั่งยืนขององค์กร",
    questions: [
      {
        id: "G4-1",
        text: "คณะกรรมการกำหนดนโยบายและแนวปฏิบัติในการขับเคลื่อนความยั่งยืนขององค์กรอย่างไร",
        type: "Sq",
      },
      {
        id: "G4-2",
        text: "มีการกำหนดนโยบาย และจรรยาบรรณธุรกิจ (Code of Conduct) เป็นลายลักษณ์อักษร",
        type: "CU",
      },
      {
        id: "G4-3",
        text: "นโยบาย และจรรยาบรรณธุรกิจ (Code of Conduct) ครอบคลุมกรรมการ ผู้บริหาร พนักงาน ตัวแทน และที่ปรึกษาขององค์กร รวมถึงผู้ที่เกี่ยวข้องในกระบวนการทางธุรกิจ",
        type: "C",
      },
      {
        id: "G4-4",
        text: "การกำหนดนโยบาย แนวปฏิบัติ และจรรยาบรรณธุรกิจ (Code of Conduct) ในการควบคุมและป้องกันการกระทำอันมิชอบ ได้แก่",
        type: "Sq",
      },
      {
        id: "G4-5",
        text: "การป้องกันการทุจริตคอร์รัปชั่น",
        type: "C",
      },
      {
        id: "G4-6",
        text: "การป้องกันความขัดแย้งทางผลประโยชน์ หรือผลประโยชน์ทับซ้อน",
        type: "C",
      },
      {
        id: "G4-7",
        text: "การป้องกันการใช้ข้อมูลภายในเพื่อประโยชน์ส่วนตน",
        type: "C",
      },
      {
        id: "G4-8",
        text: "การใช้ข้อมูลสารสนเทศและการรักษาข้อมูลความลับทั้งขององค์กร คู่ค้า และลูกค้า",
        type: "C",
      },
      {
        id: "G4-9",
        text: "การใช้ทรัพย์สินทางปัญญา (ลิขสิทธิ์ เครื่องหมาย และสิทธิบัตร) ของผู้อื่น",
        type: "C",
      },
      {
        id: "G4-10",
        text: "การไม่ปฏิบัติตามกฎหมาย",
        type: "C",
      },
      {
        id: "G4-11",
        text: "กำหนดนโยบาย แนวปฏิบัติ และจรรยาบรรณธุรกิจ (Code of Conduct) ต่อผู้เกี่ยวข้อง ได้แก่",
        type: "Sq",
      },
      {
        id: "G4-12",
        text: "สิทธิมนุษยชน",
        type: "C",
      },
      {
        id: "G4-13",
        text: "การปฏิบัติต่อคู่ค้า",
        type: "C",
      },
      {
        id: "G4-14",
        text: "การปฏิบัติต่อลูกค้า / ผู้บริโภค",
        type: "C",
      },
      {
        id: "G4-15",
        text: "การปฏิบัติต่อคู่แข่ง",
        type: "C",
      },
      {
        id: "G4-16",
        text: "การปฏิบัติต่อสังคมและชุมชน",
        type: "C",
      },
      {
        id: "G4-17",
        text: "การดูแลสุขอนามัยและความปลอดภัยของพนักงาน",
        type: "C",
      },
      {
        id: "G4-18",
        text: "กำหนดนโยบาย แนวปฏิบัติ / จรรยาบรรณธุรกิจ (Code of Conduct) ในการจัดการสิ่งแวดล้อม ได้แก่",
        type: "Sq",
      },
      {
        id: "G4-19",
        text: "การปฏิบัติตามกฎหมายด้านสิ่งแวดล้อม ได้แก่ ด้านน้ำ อากาศ และของเสีย",
        type: "C",
      },
      {
        id: "G4-20",
        text: "การใช้ทรัพยากรอย่างคุ้มค่าและยั่งยืน เช่น การหมุนเวียนนำทรัพยากรกลับมาใช้ใหม่ (Zero Waste) เป็นต้น",
        type: "C",
      },
      {
        id: "G4-21",
        text: "การอนุรักษ์ / ฟื้นฟู ทรัพยากรธรรมชาติ เช่น การอนุรักษ์ ดิน / น้ำ เป็นต้น",
        type: "C",
      },
      {
        id: "G4-22",
        text: "การจัดการก๊าซเรือนกระจก เช่น การใช้พลังงานทดแทนที่ได้จากธรรมชาติ (พลังงานแสงอาทิตย์ พลังงานลม ฯ) รวมถึงการใช้เชื้อเพลิงชีวภาพและชีวมวล (วัสดุเหลือใช้ทางการเกษตร ขยะ มูลสัตว์ ) เป็นต้น",
        type: "C",
      },
    ],
  },
  "5": {
    name: "G5 การส่งเสริมและติดตามการปฏิบัติตามจรรยาบรรณ",
    questions: [
      {
        id: "G5-1",
        text: "กำหนดกระบวนการส่งเสริมและติดตามการปฏิบัติตามจรรยาบรรณ",
        type: "Sq",
      },
      {
        id: "G5-2",
        text: "มีคู่มือปฏิบัติงานที่สำคัญ เช่น การจัดซื้อจัดจ้าง การเบิกจ่ายเงิน เป็นต้น",
        type: "CU",
      },
      {
        id: "G5-3",
        text: "มีการกำหนดอำนาจดำเนินการเพื่อกำหนดขอบเขตผู้มีอำนาจอนุมัติ เช่น การเบิกจ่ายเงิน การบริจาค การจัดซื้อจัดจ้าง การอบรมสัมมนา การเดินทางไปปฏิบัติงานนอกสถานที่ เป็นต้น",
        type: "C",
      },
      {
        id: "G5-4",
        text: "มีการสื่อสารให้พนักงานเข้าใจและตระหนักถึงการปฏิบัติตามจรรยาบรรณอย่างสม่ำเสมอ",
        type: "C",
      },
      {
        id: "G5-5",
        text: "มีการจัดอบรมพนักงานเข้าใหม่เข้าใจและตระหนักถึงการปฏิบัติตามจรรยาบรรณ",
        type: "C",
      },
      {
        id: "G5-6",
        text: "มีการกำหนดช่องทางการรับข้อร้องเรียนหรือการแจ้งเบาะแส (เช่น อีเมล์ กล่องรับข้อคิดเห็น) กระบวนการพิจารณาข้อร้องเรียน มาตรการคุ้มครองผู้ร้องเรียนหรือแจ้งเบาะแส การลงโทษผู้กระทำผิด และการเยียวยาผู้เสียหาย",
        type: "C",
      },
      {
        id: "G5-7",
        text: "มีกระบวนการติดตามการปฏิบัติตามจรรยาบรรณ หากพบการไม่ปฏิบัติตามฯ บริษัทได้มีการดำเนินการแก้ไขแล้ว",
        type: "C",
      },
      {
        id: "G5-8",
        text: "มีการประกาศเกียรติคุณ หรือให้รางวัลแก่พนักงานที่ทำดี",
        type: "CU",
      },
      {
        id: "G5-9",
        text: "มีการรายงานผลการติดตามให้กับคณะกรรมการรับทราบ",
        type: "CU",
      },
    ],
  },
  "6": {
    name: "G6 การบริหารความเสี่ยง",
    questions: [
      {
        id: "G6-1",
        text: "บริษัทดำเนินการบริหารจัดการความเสี่ยงอย่างไร",
        type: "Sq",
      },
      {
        id: "G6-2",
        text: "มีการจัดทำนโยบายและแนวปฏิบัติด้านการบริหารความเสี่ยง",
        type: "C",
      },
      {
        id: "G6-3",
        text: "มีบุคคล / หน่วยงาน / คณะทำงาน รับผิดชอบงานด้านการบริหารความเสี่ยง",
        type: "CU",
      },
      {
        id: "G6-4",
        text: "มีการประเมินความเสี่ยงครอบคลุมด้านสังคม สิ่งแวดล้อม และการกำกับดูแลกิจการที่ดี",
        type: "C",
      },
      {
        id: "G6-5",
        text: "มีการจัดทำแผนบรรเทา /ลดความเสี่ยง (Treatment Plan) โดยเฉพาะประเด็นที่มีความเสี่ยงสูงครบทุกความเสี่ยง",
        type: "C",
      },
      {
        id: "G6-6",
        text: "มีการติดตาม ทบทวน และประเมินผลการบริหารความเสี่ยงของบริษัทอย่างน้อยปีละสองครั้ง",
        type: "C",
      },
      {
        id: "G6-7",
        text: "มีการรายงานความเสี่ยงด้านต่างๆ ต่อคณะกรรมการ",
        type: "CU",
      },
    ],
  },
  "7": {
    name: "G7 การคัดเลือกคู่ค้า",
    questions: [
      {
        id: "G7-1",
        text: "บริษัทได้คัดเลือกคู่ค้าที่สามารถตอบสนองการดำเนินธุรกิจอย่างยั่งยืนของบริษัทได้ โดยครอบคลุมประเด็นต่อไปนี้แล้วหรือไม่",
        type: "Sq",
      },
      {
        id: "G7-2",
        text: "มีคู่มือกำหนดหลักเกณฑ์และกระบวนการคัดเลือกคู่ค้า",
        type: "CU",
      },
      {
        id: "G7-3",
        text: "พิจารณามาตรฐานในการดำเนินธุรกิจตามกฎหมายของคู่ค้า เช่น มีการออกใบกำกับภาษีที่ถูกต้อง ไม่มีการใช้แรงงานเด็ก มีการบำบัดน้ำเสีย เป็นต้น",
        type: "CU",
      },
      {
        id: "G7-4",
        text: "พิจารณาความสามารถการดำเนินการตามมาตรฐานต่างๆ ของคู่ค้าตามที่บริษัทกำหนดเพื่อให้ได้คุณภาพตามความต้องการของบริษัท",
        type: "C",
      },
      {
        id: "G7-5",
        text: "มีจรรยาบรรณสำหรับคู่ค้า (Supplier’s Code of Conduct) ครอบคลุมประเด็นสังคมและสิ่งแวดล้อม",
        type: "C",
      },
      {
        id: "G7-6",
        text: "มีการส่งเสริมและให้ความรู้แก่คู่ค้าในการปฏิบัติตาม Supplier’s Code of Conduct",
        type: "C",
      },
    ],
  },
  "8": {
    name: "G8 การดูแลลูกค้า /ผู้บริโภค",
    questions: [
      {
        id: "G8-1",
        text: "บริษัทมีการบริหารจัดการลูกค้า /ผู้บริโภคอย่างไร",
        type: "Sq",
      },
      {
        id: "G8-2",
        text: "สำรวจความคิดเห็นของลูกค้า / ผู้บริโภค เกี่ยวกับสินค้า / บริการ ของบริษัทอย่างสม่ำเสมอ",
        type: "C",
      },
      {
        id: "G8-3",
        text: "นำความคิดเห็นของลูกค้า / ผู้บริโภค มาปรับปรุง / พัฒนาสินค้าหรือบริการของบริษัท",
        type: "C",
      },
      {
        id: "G8-4",
        text:"มีกระบวนการเยียวยา แก้ไข ข้อร้องเรียนจากลูกค้า ทั้งนี้ หากพบมีการร้องเรียนจากลูกค้า / ผู้บริโภค บริษัทได้ดำเนินการแก้ไขแล้ว",
        type: "CU",
      },
    ],
  },
  "9": {
    name: "G9 นวัตกรรม",
    questions: [
      {
        id: "G9-1",
        text: "บริษัทมีการส่งเสริม และพัฒนานวัตกรรมทางธุรกิจหรือไม่",
        type: "Sq",
      },
      {
        id: "G9-2",
        text: "ส่งเสริมการคิดค้น/พัฒนานวัตกรรมทางธุรกิจให้เกิดขึ้นภายในบริษัท",
        type: "CU",
      },
      {
        id: "G9-3",
        text: "ในรอบปีที่ผ่านมา บริษัทได้ทำการพัฒนาสินค้า การให้บริการ หรือกระบวนการทำงานจนเกิดเป็นนวัตกรรมทางธุรกิจ",
        type: "C",
      },
    ],
  },
  "10": {
    name: "G10 การเปิดเผยข้อมูล",
    questions: [
      {
        id: "G10-1",
        text: "บริษัทได้เปิดเผยข้อมูลการดำเนินธุรกิจอย่างยั่งยืนให้ผู้มีส่วนได้เสียทราบทางสาธารณะ เช่น รายงานประจำปี Website บริษัท หรือไม่",
        type: "Sq",
      },
      {
        id: "G10-2",
        text: "เปิดเผยนโยบายด้าน ESG",
        type: "C",
      },
      {
        id: "G10-3",
        text: "เปิดเผยการปฏิบัติและผลการปฏิบัติด้าน ESG",
        type: "C",
      },
      {
        id: "G10-4",
        text: "เปิดเผยข้อมูลด้าน ESG ที่เป็นปัจจุบันบน website ของบริษัท",
        type: "CU",
      },
    ],
  },
  "11": {
    name: "E1 การบริหารจัดการสิ่งแวดล้อมในองค์กร",
    questions: [
      {
        id: "E1-1",
        text: "บริษัทมีการบริหารจัดการ และส่งเสริมเพื่อสร้างความรู้ ความตระหนักและการปฏิบัติเรื่องสิ่งแวดล้อมทั่วทั้งองค์กรอย่างไร",
        type: "Sq",
      },
      {
        id: "E1-2",
        text: "มีบุคคล / หน่วยงาน / คณะทำงาน รับผิดชอบงานด้านสิ่งแวดล้อม",
        type: "C",
      },
      {
        id: "E1-3",
        text: "มีการประเมินความเสี่ยงด้านสิ่งแวดล้อมที่ส่งผลกระทบต่อการดำเนินธุรกิจ",
        type: "C",
      },
      {
        id: "E1-4",
        text: "มีโครงการ / แผนงาน / กิจกรรมที่ส่งเสริมให้พนักงานตระหนักและมีส่วนร่วมในการปฏิบัติด้านสิ่งแวดล้อมอย่างต่อเนื่อง",
        type: "CU",
      },
      {
        id: "E1-5",
        text: "มีการให้ความรู้ด้านสิ่งแวดล้อมกับบุคลากรทั้งหมดของบริษัท",
        type: "C",
      },
    ],
  },
"12": {
    name: "E2 การบริหารจัดการการใช้ไฟ / พลังงาน",
    questions: [
      {
        id: "E2-1",
        text: "บริษัทมีการบริหารจัดการการใช้ไฟ / พลังงานที่เกิดขึ้นในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "E2-2",
        text: "การใช้ไฟ / พลังงานในการผลิตสินค้า",
        type: "CT",
      },
      {
        id: "E2-3",
        text: "การใช้ไฟ / พลังงานในอาคารสำนักงาน หรือสถานประกอบการ",
        type: "CT",
      },
      {
        id: "E2-4",
        text: "การใช้ไฟ / พลังงานในกระบวนการขนส่งสินค้า หรือส่งมอบบริการ",
        type: "CT",
      },
      {
        id: "E2-5",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการลดการใช้ไฟ / พลังงาน",
        type: "C",
      },
      {
        id: "E2-6",
        text: "มีโครงการ / แผนงาน / กิจกรรมเพื่อลดการใช้ไฟ / พลังงาน",
        type: "CU",
      },
      {
        id: "E2-7",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "C",
      },
    ],
  },
  "13": {
    name: "E3 การบริหารจัดการการใช้น้ำ",
    questions: [
      {
        id: "E3-1",
        text: "บริษัทมีการบริหารจัดการการใช้น้ำที่เกิดขึ้นในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "E3-2",
        text: "มีการบันทึกข้อมูลการใช้น้ำ",
        type: "CT",
      },
      {
        id: "E3-3",
        text: "มีกระบวนการตรวจสอบการใช้แหล่งน้ำธรรมชาติเป็นไปตามกฎหมาย ระเบียบ และข้อบังคับ ที่ใช้บังคับในพื้นที่ที่สถานประกอบการตั้งอยู่",
        type: "C",
      },
      {
        id: "E3-4",
        text: "มีการประเมินผลกระทบจากการดำเนินงานต่อชุมชนจากการใช้แหล่งน้ำธรรมชาติทั้งบนผิวดิน และใต้ดินในพื้นที่ที่สถานประกอบการตั้งอยู่",
        type: "CU",
      },
      {
        id: "E3-5",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการลดการใช้น้ำ",
        type: "C",
      },
      {
        id: "E3-6",
        text: "มีโครงการ / แผนงาน / กิจกรรม เพื่อลดการใช้น้ำ",
        type: "CU",
      },
      {
        id: "E3-7",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "C",
      },
    ],
  },
  "14": {
    name: "E4 การบริหารจัดการของเสีย",
    questions: [
      {
        id: "E4-1",
        text: "บริษัทมีการบริหารจัดการของเสียที่เกิดขึ้นในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "E4-2",
        text: "มีการบันทึกข้อมูลวัตถุดิบที่นำเข้าสู่กระบวนการผลิต ของเหลือจากการผลิตและของเสียจากการผลิต",
        type: "CU",
      },
      {
        id: "E4-3",
        text: "มีการปฏิบัติตามกฎหมาย ระเบียบ และข้อบังคับที่เกี่ยวข้องกับการกำจัดของเสียที่เกิดจากการผลิต",
        type: "C",
      },
      {
        id: "E4-4",
        text: "มีแผนป้องกัน และบำบัดของเสียก่อนปล่อยสู่ธรรรมชาติหรือชุมชน",
        type: "CU",
      },
      {
        id: "E4-5",
        text: "กรณีที่ของเสียถูกกำจัดโดยบุคคลภายนอก มีการติดตามเส้นทางการจัดการของเสียให้เป็นไปตามกฏหมายหรือข้อบังคับที่เกี่ยวข้อง",
        type: "C",
      },
      {
        id: "E4-6",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการลดของเหลือ และของเสียจากการผลิต",
        type: "C",
      },
      {
        id: "E4-7",
        text: "มีโครงการ / แผนงาน / กิจกรรม เพื่อลดของเหลือ และของเสียจากการผลิต",
        type: "CU",
      },
      {
        id: "E4-8",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "CU",
      },
    ],
  },
  "15": {
    name: "E5 การบริหารจัดการผลกระทบด้านมลภาวะ/มลพิษ",
    questions: [
      {
        id: "E5-1",
        text: "บริษัทมีการบริหารจัดการผลกระทบด้านมลภาวะ/มลพิษที่เกิดขึ้นในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "E5-2",
        text: "มีการประเมินและกำหนดมาตรการป้องกันผลกระทบด้านมลภาวะทางอากาศ น้ำ และพื้นดิน",
        type: "CU",
      },
      {
        id: "E5-3",
        text: "มีการบันทึกค่าคุณภาพของน้ำทิ้งและอากาศที่ปล่อยออกจากสถานประกอบการ",
        type: "CU",
      },
      {
        id: "E5-4",
        text: "คุณภาพของน้ำทิ้งและอากาศที่ปล่อยออกจากสถานประกอบการได้ตามมาตรฐานตามที่กฎหมายกำหนด",
        type: "C",
      },
      {
        id: "E5-5",
        text: "ในรอบปีที่ผ่านมา หากมีข้อร้องเรียนด้านสิ่งแวดล้อมจากชุมชน บริษัทได้ดำเนินการแก้ไขแล้ว",
        type: "C",
      },
      {
        id: "E5-6",
        text: "นำผลจากการร้องเรียนมาวิเคราะห์ปัญหาเพื่อปรับปรุงกระบวนการผลิต",
        type: "C",
      },
      {
        id: "E5-7",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการลดมลภาวะ/มลพิษ",
        type: "CU",
      },
      {
        id: "E5-8",
        text: "มีโครงการ / แผนงาน / กิจกรรมเพื่อลดมลภาวะ/มลพิษ",
        type: "CU",
      },
      {
        id: "E5-9",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "CU",
      },
    ],
  },
  "16": {
    name: "E6 การบริหารจัดการก๊าซเรือนกระจก",
    questions: [
      {
        id: "E6-1",
        text: "บริษัทมีการบริหารจัดการการปล่อยก๊าซเรือนกระจกที่เกิดขึ้นในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "E6-2",
        text: "มีการบันทึกข้อมูลการการคำนวณคาร์บอนฟุตพริ้นท์ที่เกิดขึ้นในกระบวนการทางธุรกิจ ดังนี้",
        type: "Sq",
      },
      {
        id: "E6-3",
        text: "Scope I : การคำนวณคาร์บอนฟุตพริ้นท์ทางตรง (Direct Emissions) จากกิจกรรมต่างๆ ขององค์กร เช่น การเผาไหม้ของเครื่องจักร การใช้พาหนะขององค์กร (ที่องค์กรเป็นเจ้าของเอง) การใช้สารเคมีในการบำบัดน้ำเสีย การรั่วซึม/รั่วไหล จากกระบวนการหรือกิจกรรม เป็นต้น",
        type: "CU",
      },
      {
        id: "E6-4",
        text: "Scope II : การคำนวณคาร์บอนฟุตพริ้นท์ทางอ้อม (Indirect Emissions) เช่น การซื้อพลังงานมาใช้ในองค์กร ได้แก่ พลังงานไฟฟ้า พลังงานความร้อน พลังงานไอน้ำ เป็นต้น",
        type: "CU",
      },
      {
        id: "E6-5",
        text: "Scope III : การคำนวณคาร์บอนฟุตพริ้นท์ทางอ้อมด้านอื่นๆ เช่น การเดินทางของพนักงานด้วยพาหนะที่ไม่ใช่ขององค์กร การเดินทางไปสัมมนานอกสถานที่ การใช้วัสดุอุปกรณ์ต่างๆ เป็นต้น",
        type: "CU",
      },
      {
        id: "E6-6",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการลดการปล่อยก๊าซเรือนกระจก",
        type: "C",
      },
      {
        id: "E6-7",
        text: "มีโครงการ / แผนงาน / กิจกรรมเพื่อลดการปล่อยก๊าซเรือนกระจก",
        type: "C",
      },
      {
        id: "E6-8",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "C",
      },
    ],
  },
  "17": {
    name: "S1 การบริหารจัดการด้านสังคมในองค์กร",
    questions: [
      {
        id: "S1-1",
        text: "บริษัทมีการบริหารจัดการ และส่งเสริมเพื่อสร้างความรู้ ความตระหนักและการปฏิบัติด้านสังคม (พนักงาน ชุมชน สังคมและคู่ค้า) ทั่วทั้งองค์กรอย่างไร",
        type: "Sq",
      },
      {
        id: "S1-2",
        text: "มีบุคคล / หน่วยงาน / คณะทำงาน รับผิดชอบงานด้านสังคม",
        type: "C",
      },
      {
        id: "S1-3",
        text: "มีการประเมินความเสี่ยงด้านสังคมที่ส่งผลกระทบต่อการดำเนินธุรกิจ",
        type: "CU",
      },
      {
        id: "S1-4",
        text: "มีโครงการ / แผนงาน / กิจกรรมที่ส่งเสริมให้พนักงานตระหนักและมีส่วนร่วมในการปฏิบัติด้านสังคมอย่างต่อเนื่อง",
        type: "CU",
      },
      {
        id: "S1-5",
        text: "มีการให้ความรู้ด้านสังคมกับบุคลากรของบริษัท",
        type: "C",
      },
    ],
  },
  "18": {
    name: "S2 การบริหารจัดการด้านสิทธิมนุษยชน",
    questions: [
      {
        id: "S2-1",
        text: "บริษัทมีการบริหารจัดการเรื่องสิทธิมนุษยชนในกระบวนการทางธุรกิจอย่างไร",
        type: "Sq",
      },
      {
        id: "S2-2",
        text: "มีการประเมินความเสี่ยงด้านสิทธิมนุษยชนที่ส่งผลกระทบต่อการดำเนินธุรกิจ",
        type: "CU",
      },
      {
        id: "S2-3",
        text: "มีการกำหนดมาตรการ หรือแนวทางในการป้องกัน แก้ไข และยุติประเด็นความขัดแย้งจากการละเมิดสิทธิมนุษยชน",
        type: "CU",
      },
      {
        id: "S2-4",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการป้องกันการละเมิดสิทธิมนุษยชน",
        type: "C",
      },
      {
        id: "S2-5",
        text: "มีโครงการ / แผนงาน / กิจกรรมเพื่อป้องกันการละเมิดสิทธิมนุษยชน",
        type: "CU",
      },
      {
        id: "S2-6",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "C",
      },
    ],
  },
  "19": {
    name: "S3 การจ้างงานตามหลักกฎหมายและสิทธิมนุษยชน",
    questions: [
      {
        id: "S3-1",
        text: "บริษัทมีการจ้างงานตามหลักกฎหมายและคำนึงถึงสิทธิมนุษยนชน",
        type: "Sq",
      },
      {
        id: "S3-2",
        text: "มีการปฏิบัติตามหลักสิทธิมนุษยชนต่อแรงงานในอันที่จะไม่เลือกปฏิบัติในเรื่องเชื้อชาติ สัญชาติ การกำเนิดทางสังคมหรือชาติพันธุ์ เพศ รสนิยมทางเพศ สภาพร่างกาย ความพิการทางกาย อายุ สถานะทางสังคม ความเห็นทางการเมือง ประเพณีนิยม การเป็นสมาชิกในองค์กรหรือสมาคมหรือการรวมกลุ่มทางสังคม",
        type: "C",
      },
      {
        id: "S3-3",
        text: "มีการจ้างงานและการดูแลพนักงานให้เป็นไปตามข้อกำหนดของกฎหมาย เช่น การจ่ายค่าตอบแทนอย่างน้อยตามอัตราค่าจ้างขั้นต่ำ เป็นต้น",
        type: "CU",
      },
      {
        id: "S3-4",
        text: "มีสวัสดิการนอกเหนือจากที่กฎหมายกำหนด เช่น กองทุนสำรองเลี้ยงชีพ เงินกู้เพื่อที่อยู่อาศัย สวัสดิการรักษาพยาบาล เป็นต้น",
        type: "CU",
      },
      {
        id: "S3-5",
        text: "มีมาตรการป้องกัน และลงโทษ พนักงานที่แสดงพฤติกรรมเชิงลบในทางเพศสภาพหรือรสนิยมทางเพศ หรือกระทำการใดในลักษณะทำนองเดียวกัน",
        type: "C",
      },
      {
        id: "S3-6",
        text: "มีมาตรการป้องกัน และลงโทษ พนักงานที่แสดงพฤติกรรมล่วงละเมิด คุกคาม หรือข่มขู่ หรือกระทำการใดในลักษณะทำนองเดียวกัน",
        type: "C",
      },
      {
        id: "S3-7",
        text: "มีการจ้างงานผู้พิการ (ไม่นับกรณีการจ่ายเงินเข้ากองทุนส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการแทนการจ้างงาน)",
        type: "C",
      },
      {
        id: "S3-8",
        text: "ให้เสรีภาพแก่พนักงานในการแสดงความคิดเห็น",
        type: "CU",
      },
      {
        id: "S3-9",
        text: "ให้เสรีภาพพนักงานในการใช้สิทธิหรือแสดงความคิดเห็นทางการเมืองของพนักงาน แต่พนักงานต้องไม่กระทำการใดๆ ที่จะทำให้บริษัทเข้าไปมีส่วนเกี่ยวข้องกับการใช้สิทธิหรือแสดงความคิดเห็นทางการเมืองดังกล่าว",
        type: "C",
      },
      {
        id: "S3-10",
        text: "มีมาตรการป้องกันการใช้แรงงานบังคับ",
        type: "C",
      },
      {
        id: "S3-11",
        text: "ปฏิบัติตามกฎหมายว่าด้วยการใช้แรงงานเด็ก และการใช้แรงงานในสภาวะที่ส่งผลเสียต่อสุขภาพร่างกายหรือจิตใจ",
        type: "C",
      },
      {
        id: "S3-12",
        text: "มีกระบวนการเยียวยาแก้ไขด้านแรงงาน ทั้งนี้ หากบริษัทเคยถูกพนักงานฟ้องร้องดำเนินคดีแรงงาน บริษัทได้มีการแก้ไข และเยียวยาแล้วบนความยินยอมของผู้ร้องเรียน",
        type: "C",
      },
      {
        id: "S3-13",
        text: "บริษัทกำหนดเป้าหมายเชิงปริมาณในดูแลพนักงาน เช่น อัตราการลาออก ผลประเมินความพึงพอใจพนักงาน เป็นต้น",
        type: "C",
      },
      {
        id: "S3-14",
        text: "มีโครงการ / แผนงาน / กิจกรรม ในการสร้างสัมพันธ์ที่ดีในการอยู่ร่วมกันอย่างเป็นสุขระหว่างพนักงานและบริษัท",
        type: "CU",
      },
      {
        id: "S3-15",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "CU",
      },
    ],
  },
  "20": {
    name: "S4 การดูแลสุขภาวะและความปลอดภัย",
    questions: [
      {
        id: "S4-1",
        text: "บริษัทมีการบริหารจัดการเรื่องสุขภาวะและความปลอดภัยในสถานประกอบการอย่างไร",
        type: "Sq",
      },
      {
        id: "S4-2",
        text: "มีการประเมินความเสี่ยงด้านสุขภาวะอนามัยและความปลอดภัยของพนักงาน และลูกจ้างในสถานประกอบการ",
        type: "CU",
      },
      {
        id: "S4-3",
        text: "มีการกำหนดมาตรการและวิธีปฏิบัติเรื่องการดูแลสุขภาวะอนามัยและความปลอดภัยของพนักงาน และลูกจ้าง เช่น จัดให้มีอุปกรณ์ป้องกันความเสี่ยงจากอุบัติเหตุในงานที่มีลักษณะอันตราย จัดให้มีการตรวจสุขภาพพนักงานและลูกจ้างที่ปฎิบัติงานที่มีลักษณะอันตรายต่อสุขภาพเป็นประจำ",
        type: "C",
      },
      {
        id: "S4-4",
        text: "มีมาตรการและวิธีปฏิบัติในการดำเนินงานที่เป็นไปตามมาตรฐานความปลอดภัยและสุขอนามัย",
        type: "C",
      },
      {
        id: "S4-5",
        text: "บันทึกข้อมูลสถิติเกี่ยวกับการเจ็บป่วย บาดเจ็บ ทุพพลภาพ เสียชีวิต หรือเหตุการณ์เกี่ยวข้องกับความปลอดภัยของพนักงานและลูกจ้าง",
        type: "CU",
      },
      {
        id: "S4-6",
        text: "มีการวิเคราะห์ข้อมูลเพื่อปรับปรุงและพัฒนาการดูแลสุขภาวะอนามัยและความปลอดภัยของพนักงานและลูกจ้างอย่างต่อเนื่อง",
        type: "C",
      },
      {
        id: "S4-7",
        text: "บริษัทกำหนดเป้าหมายเชิงปริมาณในดูแลเรื่องสุขภาวะอนามัยและความปลอดภัยในสถานประกอบการ",
        type: "C",
      },
      {
        id: "S4-8",
        text: "มีโครงการ / แผนงาน / กิจกรรม ในการสร้างสุขภาวะและความปลอดภัยในสถานประกอบการ",
        type: "CU",
      },
      {
        id: "S4-9",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "CU",
      },
    ],
  },
  "21": {
    name: "S5 การพัฒนาพนักงาน",
    questions: [
      {
        id: "S5-1",
        text: "บริษัทพัฒนาศักยภาพและส่งเสริมความก้าวหน้าของพนักงานหรือไม่",
        type: "Sq",
      },
      {
        id: "S5-2",
        text: "มีการพัฒนาทักษะที่จำเป็นตามลักษณะงานที่รับผิดชอบ และศักยภาพของพนักงานเพื่อการปฏิบัติงานในระดับที่สูงขึ้น",
        type: "C",
      },
      {
        id: "S5-3",
        text: "มีการจัดทำ Succession Plan สำหรับตำแหน่งงานสำคัญ",
        type: "C",
      },
      {
        id: "S5-4",
        text: "มีการกำหนดเป้าหมายเชิงปริมาณในการพัฒนาศักยภาพและส่งเสริมความก้าวหน้าของพนักงาน",
        type: "C",
      },
      {
        id: "S5-5",
        text: "มีโครงการ / แผนงาน / กิจกรรม ในการพัฒนาศักยภาพและส่งเสริมความก้าวหน้าของพนักงาน",
        type: "CU",
      },
      {
        id: "S5-6",
        text: "มีการติดตามและประเมินผลการปฏิบัติตามเป้าหมายที่กำหนดไว้",
        type: "CU",
      },
    ],
  },
  "22": {
    name: "S6 การประเมินความพึงพอใจของพนักงานและการจัดการข้อร้องทุกข์",
    questions: [
      {
        id: "S6-1",
        text: "บริษัทได้วัดระดับความพึงพอใจของพนักงานอย่างไร",
        type: "Sq",
      },
      {
        id: "S6-2",
        text: "มีการวัดและประเมินผลความพึงพอใจ และ/หรือ ความผูกพันของพนักงาน",
        type: "CU",
      },
      {
        id: "S6-3",
        text: "มีการสื่อสารผลการประเมินความพึงพอใจให้พนักงานทั้งองค์กรได้รับทราบ",
        type: "C",
      },
      {
        id: "S6-4",
        text: "มีช่องทางให้พนักงานสามารถสื่อสาร ร้องเรียน เสนอแนะ ถึงผู้บริหารได้โดยตรง",
        type: "C",
      },
      {
        id: "S6-5",
        text: "มีการนำผลการประเมินความพึงพอใจของพนักงานไปวิเคราะห์เพื่อพัฒนาและปรับปรุงการดูแลพนักงาน",
        type: "CU",
      },
      {
        id: "S6-6",
        text: "มีการนำผลการประเมินข้อร้องทุกข์ของพนักงานไปกำหนดกระบวนการเยียวยาและชดเชย",
        type: "CU",
      },
    ],
  },
  "23": {
    name: "S7 การส่งเสริมความรู้เรื่องการเงิน",
    questions: [
      {
        id: "S7-1",
        text: "บริษัทได้ส่งเสริมความรู้ และความเข้าใจด้านการออมเพื่อสร้างความมั่นคงทางการเงินให้กับพนักงาน",
        type: "Sq",
      },
      {
        id: "S7-2",
        text: "มีการสนับสนุนให้พนักงานมีความรู้เรื่องการออม การบริหารจัดการเงิน อย่างน้อยปีละครั้ง",
        type: "C",
      },
      {
        id: "S7-3",
        text: "มีการจัดตั้งกองทุนสำรองเลี้ยงชีพหรือกลไกอื่นเพื่อส่งเสริมให้พนักงานมีการออม",
        type: "C",
      },
      {
        id: "S7-4",
        text: "มีโครงการเพื่อส่งเสริมให้พนักงานเกิดความมั่นคงทางการเงินในระยะยาว เช่น โครงการส่งเสริมการออม โครงการแก้ปัญหาหนี้สิน เป็นต้น",
        type: "CU",
      },
    ],
  },
  "24": {
    name: "S8 การปฏิบัติต่อคู่ค้าอย่างเป็นธรรม",
    questions: [
      {
        id: "S8-1",
        text: "บริษัทมีมาตรการปฏิบัติต่อคู่ค้าให้เกิดความเป็นธรรมโดยไม่เอารัดเอาเปรียบอย่างไร",
        type: "Sq",
      },
      {
        id: "S8-2",
        text: "มีนโยบายและแนวปฏิบัติการชำระเงินให้แก่คู่ค้า โดยแจ้งให้คู่ค้ารับทราบก่อนเริ่มทำสัญญากับคู่ค้า",
        type: "CU",
      },
      {
        id: "S8-3",
        text: "มีการชำระค่าสินค้า หรือบริการให้แก่คู่ค้าตรงตามนโยบายและแนวปฏิบัติที่บริษัทกำหนด หรือตามสัญญาที่ทำกับคู่ค้า",
        type: "C",
      },
      {
        id: "S8-4",
        text: "มีกระบวนการป้องกันการไม่ปฏิบัติตามสัญญาแก่คู่ค้า ทั้งนี้ หากบริษัทเคยถูกคู่ค้าฟ้องร้องดำเนินคดีการไม่ปฏิบัติตามสัญญา บริษัทได้แก้ไขและเยียวยาแล้ว",
        type: "C",
      },
    ],
  },
  "25": {
    name: "S9 การมีส่วนร่วมกับชุมชน",
    questions: [
      {
        id: "S9-1",
        text: "บริษัทมีมาตรการส่งเสริมการอยู่ร่วมกับชุมชนรอบข้างอย่างสันติสุขอย่างไร",
        type: "Sq",
      },
      {
        id: "S9-2",
        text: "มีกระบวนการป้องกันและมาตรการเยียวยาแก้ไขผลกระทบเชิงลบต่อชุมชน",
        type: "C",
      },
      {
        id: "S9-3",
        text: "มีโครงการหรือกิจกรรมที่เป็นประโยชน์และพัฒนาความเป็นอยู่ของชุมชนเพื่อการอยู่ร่วมกันอย่างเป็นสุข เช่น การส่งเสริมอาชีพในชุมชน การส่งเสริมสภาพแวดล้อมที่ปลอดภัยในชุมชน เป็นต้น",
        type: "CU",
      },
      {
        id: "S9-4",
        text: "มีการจัดตั้งคณะกรรมการร่วมกับชุมชน โดยมีการประชุมร่วมกันอย่างสม่ำเสมอเพื่อระบุถึงปัญหาที่เกิดจากการดำเนินธุรกิจและแนวทางการดูแล / ปรับปรุงแก้ไขปัญหาที่เกิดขึ้น",
        type: "C",
      },
      {
        id: "S9-5",
        text: "มีการติดตามและประเมินผลการปฏิบัติ",
        type: "CU",
      },
    ],
  },
  "26": {
    name: "S10 ความรับผิดชอบต่อสินค้าหรือบริการต่อผู้บริโภค",
    questions: [
      {
        id: "S10-1",
        text: "บริษัทมีความรับผิดชอบต่อสินค้าหรือบริการของบริษัทต่อผู้บริโภคและสังคมอย่างไร",
        type: "Sq",
      },
      {
        id: "S10-2",
        text: "มีนโยบายและแนวปฏิบัติด้านความปลอดภัยของสินค้า และบริการต่อผู้บริโภคและสังคม",
        type: "C",
      },
      {
        id: "S10-3",
        text: "มีการประเมินความปลอดภัยของสินค้า และบริการของบริษัท ที่ส่งผลกระทบต่อผู้บริโภค เช่น ความปลอดภัยในการใช้สินค้า การรักษาข้อมูลความลับของลูกค้า เป็นต้น",
        type: "CU",
      },
      {
        id: "S10-4",
        text: "การปฏิบัติตามกฎหมายและมาตรฐานในเรื่องความปลอดภัยและสุขอนามัยที่ใช้บังคับกับสินค้าหรือบริการของบริษัท",
        type: "C",
      },
      {
        id: "S10-5",
        text: "ให้ข้อมูลของสินค้าและบริการที่เข้าถึงได้ง่ายต่อผู้บริโภค เช่น แหล่งกำเนิดสินค้า ที่มา สัดส่วน ของวัตถุดิบที่ใช้ผลิตสินค้า ผู้รับเหมาช่วงของบริษัท เป็นต้น",
        type: "C",
      },
      {
        id: "S10-6",
        text: "การปฏิบัติตามกฎหมายและมาตรฐานในเรื่องข้อมูลส่วนบุคคลของผู้บริโภคและสาธารณชน",
        type: "C",
      },
      {
        id: "S10-7",
        text: "มีการบันทึกข้อมูลประเด็นปัญหาที่เกิดขึ้นจากสินค้าหรือบริการ",
        type: "CU",
      },
      {
        id: "S10-8",
        text: "มีการนำผลการประเมินไปวิเคราะห์เพื่อพัฒนาและปรับปรุงสินค้าหรือบริการของบริษัท",
        type: "CU",
      },
      {
        id: "S10-9",
        text: "มีการติดตามและประเมินผลการปฏิบัติ",
        type: "CU",
      },
    ],
  }
};